## Lab 4 Summary

In [2]:
import datascience as ds
import numpy as np
import matplotlib.pyplot as plt
import seaborn
from datetime import datetime
seaborn.set_context(rc={'lines.markeredgewidth': 1.0})
%matplotlib inline

Load in data for power in 2014 and weather data since 2011

In [16]:
table_load = ds.Table.read_table("2014.csv")
table_load["DAY"] = table_load.select("DAY").apply(lambda x: datetime.strptime(x[0],"%m/%d/%y")) #Formatting to Year-month-day time 
table_load

DAY                 | HOUR | PJME  | PJMW | COMED | DAYTON | AEP   | DUQ  | DOM   | FE   | DEOK | EKPC
2014-12-31 00:00:00 | 100  | 30795 | 6088 | 11633 | 1912   | 15993 | 1562 | 12337 | 7547 | 3067 | 1882
2014-12-31 00:00:00 | 200  | 29995 | 6010 | 11139 | 1875   | 15780 | 1550 | 12267 | 7334 | 3024 | 1845
2014-12-31 00:00:00 | 300  | 29688 | 5991 | 10871 | 1866   | 15769 | 1545 | 12345 | 7196 | 3021 | 1902
2014-12-31 00:00:00 | 400  | 29767 | 6051 | 10735 | 1883   | 15738 | 1546 | 12589 | 7153 | 3031 | 1894
2014-12-31 00:00:00 | 500  | 30426 | 6177 | 10714 | 1910   | 15993 | 1539 | 13046 | 7305 | 3111 | 1927
2014-12-31 00:00:00 | 600  | 32147 | 6351 | 10886 | 2004   | 16635 | 1574 | 13771 | 7539 | 3249 | 2061
2014-12-31 00:00:00 | 700  | 34613 | 6733 | 11404 | 2133   | 17476 | 1680 | 14379 | 8042 | 3445 | 2122
2014-12-31 00:00:00 | 800  | 35973 | 6964 | 12098 | 2250   | 18170 | 1777 | 14735 | 8346 | 3621 | 2244
2014-12-31 00:00:00 | 900  | 36253 | 7047 | 12409 | 2272   | 18359 | 1788 | 14573 | 8367 | 3667 | 2219
2014-12-31 00:00:00 | 1000 | 35998 | 6999 | 12526 | 2268   | 18173 | 1844 | 14233 | 8408 | 3650 | 2175
... (8750 rows omitted)

In [15]:
#Reading and formatting datasets

table_weather = ds.Table.read_table("weather_kpit.csv")
table_weather["Local Time"] = table_weather.select("Local Time").apply(lambda x: datetime.strptime(x[0]," %m/%d/%Y %I:%M %p")) #Change to Year-month-day time format
table_weather["Date"] = table_weather.select("Local Time").apply(lambda x : x[0].date()) #Adding another column with just the date
table_weather

UTC Timestamp | Local Time          | Temperature | Dewpoint | Humidity | Pressure | Wind Speed | Condition   | Date
1293861060    | 2011-01-01 00:51:00 | 50          | 43       |  77      | 30.03    |  4.6       |  Overcast   | 2011-01-01
1293864660    | 2011-01-01 01:51:00 | 50          | 43       |  77      | 30.01    |  4.6       |  Overcast   | 2011-01-01
1293868260    | 2011-01-01 02:51:00 | 51.1        | 43       |  74      | 30.01    |  4.6       |  Overcast   | 2011-01-01
1293871860    | 2011-01-01 03:51:00 | 51.1        | 42.1     |  71      | 29.97    |  6.9       |  Overcast   | 2011-01-01
1293875460    | 2011-01-01 04:51:00 | 51.1        | 42.1     |  71      | 29.95    |  4.6       |  Overcast   | 2011-01-01
1293879060    | 2011-01-01 05:51:00 | 51.1        | 46       |  83      | 29.99    |  6.9       |  Light Rain | 2011-01-01
1293882660    | 2011-01-01 06:51:00 | 51.1        | 48       |  89      | 29.99    |  8.1       |  Light Rain | 2011-01-01
1293886260    | 2011-01-01 07:51:00 | 50          | 48.9     |  96      | 29.96    |  4.6       |  Light Rain | 2011-01-01
1293888180    | 2011-01-01 08:23:00 | 51.8        | 48.2     |  88      | 29.94    |  3.5       |  Light Rain | 2011-01-01
1293889860    | 2011-01-01 08:51:00 | 51.1        | 50       |  96      | 29.98    |  5.8       |  Light Rain | 2011-01-01
... (58281 rows omitted)

In [27]:
# Group temperature with date
table_daily = table_weather.select(["Date","Temperature"]).group('Date',np.max) #Group together all the columns with the same date and take the largest value  
table_load_daily = table_load.select(["DAY","DUQ"]).group("DAY",np.max) #Repeating above line for power load data
table_load_daily["DUQ amax"] = table_load_daily.select("DUQ amax").apply(lambda x: x[0]/1000) #Dividing each row of DUQ amaz by 1000
table_load_daily

DAY                 | DUQ amax
2014-01-01 00:00:00 | 1.86
2014-01-02 00:00:00 | 2.118
2014-01-03 00:00:00 | 2.124
2014-01-04 00:00:00 | 1.858
2014-01-05 00:00:00 | 1.831
2014-01-06 00:00:00 | 2.29
2014-01-07 00:00:00 | 2.367
2014-01-08 00:00:00 | 2.194
2014-01-09 00:00:00 | 2.009
2014-01-10 00:00:00 | 1.902
... (355 rows omitted)

In [28]:
# Take only 2014 data
table_daily = table_daily.where(list(map(lambda x: x.year == 2014, table_daily["Date"]))) #Chooses the data with the year 2014

"""maps(function, list): applies the function to each item in the list, http://book.pythontips.com/en/latest/map_filter.html"""

table_daily.relabel("Temperature amax","Temperature")
table_daily["Load"] = table_load_daily["DUQ amax"]

table_daily

Date       | Temperature | Load
2014-01-01 | 33.1        | 1.86
2014-01-02 | 30.2        | 2.118
2014-01-03 | 15.1        | 2.124
2014-01-04 | 37          | 1.858
2014-01-05 | 46          | 1.831
2014-01-06 | 48.9        | 2.29
2014-01-07 | 3.9         | 2.367
2014-01-08 | 23          | 2.194
2014-01-09 | 33.1        | 2.009
2014-01-10 | 46.4        | 1.902
... (355 rows omitted)

In [31]:
# Take only summers or June to August
table_summer = table_daily.where(list(map(lambda x: x.month >= 6 and x.month <=8, table_daily["Date"])))

table_summer

Date       | Temperature | Load
2014-06-01 | 82          | 1.922
2014-06-02 | 78.1        | 2.169
2014-06-03 | 82.9        | 2.384
2014-06-04 | 73.9        | 2.049
2014-06-05 | 69.1        | 1.835
2014-06-06 | 75          | 1.81
2014-06-07 | 79          | 1.845
2014-06-08 | 78.1        | 1.858
2014-06-09 | 68          | 1.808
2014-06-10 | 73.9        | 1.895
... (82 rows omitted)

### Estimate parameters of Linear Regressor: Least squares fit

Refer to Lecture 4, slide 7 for these equations
$$\theta_1 = \frac{\sum_{i\in \text{Data}}\ x_i (y_i - E(y)) }{\sum_{i \in \text{Data}}\ x_i (x_i - E(x))}$$
$$\theta_2 = -\theta_1E(x) + E(y)$$

In [33]:
#From table_summer, to determine the theta, or slope and the y-intercept of the linear regression line, we can apply the
#equations above to the data set
x = table_summer["Temperature"]
y = table_summer["Load"]
theta1 = np.sum(x*(y-np.mean(y)))/np.sum(x*(x-np.mean(x)))
theta2 = -theta1*np.mean(x) + np.mean(y)
theta1, theta2

(0.044152538599092142, -1.3636304123131144)

Refer to Lecture 4, slide 10 for these equations:
$$\theta = (X^\top X)^{-1} X^\top y$$
$$ X = \begin{bmatrix}
x_1&1\\
x_2&1\\
\vdots&\vdots\\
x_N&1
\end{bmatrix} \quad \text{where} \quad N = \text{number of data}$$

In [34]:
# Another way to find theta, is to use linear algebra, using the equations above to determine the theta.
X = np.vstack([table_summer["Temperature"], np.ones(len(table_summer.column(0)))]).T
y = table_summer["Load"]
theta = np.linalg.solve(X.T.dot(X), X.T.dot(y))
theta

array([ 0.04415254, -1.36363041])